<?php

return [
    '1.0.0' => [
        '原始版本发布',
    ],
    '1.0.1' => [
        '增加调试模式开关 & 侧栏子菜单缩进增加',
    ],
    '1.0.2' => [
        '扩展表单字段 selectCreate 为 select 字段的升级版，支持快速创建。',
    ],
    '1.0.3' => [
        '增加扩展图标和别名。',
    ],
    '1.0.4' => [
        '增加表单提交预处理过滤，防止XSS攻击。',
    ],
    '1.0.5' => [
        '优化表单提交预处理过滤，不再依赖第三方包。',
    ],
    '1.0.6' => [
        'selectCreate组件的颜色改为主题色。',
        'UI增加表格行操作按钮紧贴最右侧。'
    ],
    '1.0.7' => [
        '支持DcatAdmin 2.0.18beta。',
        '暂时移除侧栏菜单子菜单缩进（不兼容）。',
        '增加水平菜单选项。',
        '原先的头部块状显示改为边距优化'
    ],
    '1.0.8' => [
        '提供了自定义颜色的支持入口',
    ],
    '1.0.9' => [
        '移除HTML、JS过滤',
        '移除部分UI优化'
    ],
    '1.1.0' => [
        '修复debug配置无效的问题',
        '自动注入扩展字段',
        '移除了一些无用的配置'
    ],
    '1.1.1' => [
        '增加详情页视频扩展字段',
    ],
];
